#include <string>
#include <vector>
std::vector<std::string> suffix_list = {
    "ኦችኣችኧውንንኣ", "ኦችኣችህኡ", "ኦችኣችኧውን", "ኣችኧውንንኣ", "ኦችኣችኧው", "ኢዕኧልኧሽ", "ኦችኣችን",
    "ኣውኢው",      "ኣችኧውኣል", "ችኣት",     "ችኣችህኡ",   "ችኣችኧው",  "ኣልኧህኡ",  "ኣውኦች",
    "ኣልኧህ",      "ኣልኧሽ",   "ኣልችህኡ",   "ኣልኣልኧች",  "ብኣችኧውስ", "ብኣችኧው",  "ኣችኧውን",
    "ኣልኧች",      "ኣልኧን",   "ኣልኣችህኡ",  "ኣችህኡን",   "ኣችህኡ",   "ኣችህኡት",  "ውኦችንንኣ",
    "ውኦችን",      "ኣችኧው",   "ውኦችኡን",   "ውኦችኡ",    "ውንኣ",    "ኦችኡን",   "ውኦች",
    "ኝኣንኧትም",    "ኝኣንኣ",   "ኝኣንኧት",   "ኝኣን",     "ኝኣውም",   "ኝኣው",    "ኣውኣ",
    "ብኧትን",      "ኣችህኡም",  "ችኣችን",    "ኦችህ",     "ኦችሽ",    "ኦችኡ",    "ኦችኤ",
    "ኦውኣ",       "ኦቿ",     "ችው",      "ችኡ",      "ኤችኡ",    "ንኧው",    "ንኧት",
    "ኣልኡ",       "ኣችን",    "ክኡም",     "ክኡት",     "ክኧው",    "ችን",     "ችም",
    "ችህ",        "ችሽ",     "ችን",      "ችው",      "ይኡሽን",   "ይኡሽ",    "ውኢ",
    "ኦችንንኣ",     "ኣውኢ",    "ብኧት",     "ኦች",      "ኦችኡ",    "ውኦን",    "ኝኣ",
    "ኝኣውን",      "ኝኣው",    "ኦችን",     "ኣል",      "ም",      "ሽው",     "ክም",
    "ኧው",        "ውኣ",     "ትም",      "ውኦ",      "ውም",     "ውን",     "ንም",
    "ሽን",        "ኣች",     "ኡት",      "ኢት",      "ክኡ",     "ኤ",      "ህ",
    "ሽ",         "ኡ",      "ሽ",       "ክ",       "ች",      "ኡን",     "ን",
    "ም",         "ንኣ"};

const const std::vector<std::string> prefix_list = {
    "ስልኧምኣይ", "ይኧምኣት", "ዕንድኧ", "ይኧትኧ", "ብኧምኣ", "ብኧትኧ", "ዕኧል", "ስልኧ",
    "ምኧስ",    "ዕይኧ",   "ይኣል",  "ስኣት",  "",     "ስኣን",  "ስኣይ", "ስኣል",
    "ይኣስ",    "ይኧ",    "ልኧ",   "ብኧ",   "ክኧ",   "እን",   "አል",  "አስ",
    "ትኧ",     "አት",    "አን",   "አይ",   "ይ",    "አ",    "እ"};
